xmlsamples/PI_MTCN/KR-SMV-BIS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
	<soapenv:Header/>
	<soapenv:Body>
		<ns2:esp-send-money-validation-request xmlns:ns2="http://www.westernunion.com/schema/xrsi">
			<partner>
				<id>WGBSKRAP10T</id>
				<system>
					<id>WGBSKRAP10T</id>
					<name>Demo</name>
					<version>9101</version>
					<ip_address>172.31.19.212</ip_address>
					<connector>
						<id>KRAP1EWT001A</id>
					</connector>
				</system>
			</partner>
			<device>
				<id>BC</id>
				<type>DMAMOB</type>
			</device>
			<external_reference_no>1232</external_reference_no>
			<sender>
				<name>
					<first_name>KYEONGMIN</first_name>
					<last_name>LEE</last_name>
				</name>
				<address>
					<country_iso_code>SA</country_iso_code>
				</address>
				<compliance_details>
					<template_id>INT_06_S</template_id>
					<id_documents>
						<id_document>
							<type>A</type>
							<data>A222221111</data>
							<issue_country>
								<country_name>Korea</country_name>
							</issue_country>
							<expiration_date>30122026</expiration_date>
							<id_expires>true</id_expires>
						</id_document>
					</id_documents>
					<date_of_birth>30121986</date_of_birth>
					<Country_of_Birth>KOREA</Country_of_Birth>
					<ack_flag>X</ack_flag>
				</compliance_details>
				<contact_phone>8201095991874</contact_phone>
				<mobile_phone>
					<phone_number>
						<country_code>82</country_code>
						<national_number>01095991874</national_number>
					</phone_number>
				</mobile_phone>
				<home_phone>
					<city_code>82</city_code>
					<number>01095991874</number>
				</home_phone>
				<bank_account>
					<name>Hanpass</name>
					<account_number>01095991874</account_number>
				</bank_account>
			</sender>
			<receiver>
				<name>
					<first_name>AADIL</first_name>
					<last_name>KATTEKAR</last_name>
				</name>
			</receiver>
			<wu_product>
				<name>MONEY IN MINUTES</name>
				<code>000</code>
			</wu_product>
               <transaction_type>WMF</transaction_type>
               <payment_details>
                  <origination>
                     <principal_amount>20</principal_amount>
                     <gross_amount>1220</gross_amount>
                     <currency_iso_code>USD</currency_iso_code>
                     <country_iso_code>KR</country_iso_code>
                  </origination>
                  <destination>
                     <expected_payout_amount>1000</expected_payout_amount>
                     <currency_iso_code>PHP</currency_iso_code>
                     <country_iso_code>PH</country_iso_code>
                  </destination>
                  <promotion>
                     <discount>0</discount>
                     <status>0</status>
                  </promotion>
                  <taxes>
                     <tax_amount>0</tax_amount>
                  </taxes>
                  <fees>
                     <charges>1200</charges>
                  </fees>
                  <message_charges/>
                  <exchange_rate>49.254821</exchange_rate>
                  <payment_digest>03630109AYX0098300202200301004037AM0503PIL06030000703PIL0803WMF0900035710001204120013010140101504122016041200170101901020002101N0312220023002400</payment_digest>
               </payment_details>
		</ns2:esp-send-money-validation-request>
	</soapenv:Body>
</soapenv:Envelope>